app/channels/chat_channel.rb

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "um"], ["created_at", "2018-09-01 19:42:37.408971"], ["updated_at", "2018-09-01 19:42:37.408971"]]
---
  def speak (data)
  	Message.create! content: data['message']