app/controllers/chats_controller.rb

SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def show
  	#@messages = Message.all
  	@messages = Message.page(params[:page]).per(10).order(id: :desc)