app/controllers/messages_controller.rb

  def update
    respond_to do |format|
      if @message.update(message_params)
---
UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "Cinco"], ["updated_at", "2018-09-01 19:47:47.341128"], ["id", 5]]